renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_sci_iic_rx/src/r_sci_iic_rx.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products.
 * No other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
 * applicable laws, including copyright laws. 
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO 
 * THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the 
 * following link:
 * http://www.renesas.com/disclaimer 
 *
 * Copyright (C) 2013(2019) Renesas Electronics Corporation. All rights reserved.
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_sci_iic_rx.c
 * Description  : Functions for using SCI_IIC on RX devices. 
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 01.07.2013 1.00     First Release
 *         : 30.09.2013 1.10     Change symbol of return value and status
 *         : 01.07.2014 1.20     RX110 support added.
 *         : 22.09.2014 1.30     RX64M support added.
 *         : 01.12.2014 1.40     RX113 support added.
 *         : 15.12.2014 1.50     RX71M support added.
 *         : 27.02.2015 1.60     RX63N support added.
 *         : 29.05.2015 1.70     RX231 support added.
 *         : 31.10.2015 1.80     RX130, RX230, RX23T support added.
 *         : 04.03.2016 1.90     RX24T support added.
 *         : 01.10.2016 2.00     Fixed a program according to the Renesas coding rules.
 *         : 31.08.2017 2.20     Changed about the calculation processing for address of PIDR.
 *         : 29.01.2018 2.30     Reset Setting added for (SCR.RE, SCR.TE, SSR.RDRF).
 *         : 27.04.2018 2.30     Added "for", "while" and "do while" comment.
 *         : 21.09.2018 2.40     RX72T support added.
 *         : 20.05.2019 2.41     Added support for GNUC and ICCRX.
 *                               Fixed coding style.
 *         : 20.06.2019 2.42     RX23W support added.
 *         : 30.07.2019 2.43     RX72M support added.
 *         : 30.10.2019 2.44     RX13T support added.
 *         : 22.11.2019 2.45     RX66N, RX72N support added.
 *                               Modified comment of API function to Doxygen style.
 **********************************************************************************************************************/
/***********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 **********************************************************************************************************************/
#include <stddef.h>
/* Fixed width integers */
#include <stdint.h>
/* Boolean defines */
#include <stdbool.h>

/* Access to peripherals and board defines. */
#include "platform.h"

/* Defines for SCI_IIC support */
#include "r_sci_iic_rx_private.h"
#include "r_sci_iic_rx_if.h"
#include "r_sci_iic_rx_config.h"

/* Include specifics for chosen MCU.  */
#include "r_sci_iic_rx_platform.h"

/***********************************************************************************************************************
 Private global variables and functions
 **********************************************************************************************************************/
/*----------------------------------------------------------------------------*/
/*  Main processing of SCI IIC Driver API functions                           */
/*----------------------------------------------------------------------------*/
static sci_iic_return_t sci_iic_open (sci_iic_info_t * p_sci_iic_info);
static sci_iic_return_t sci_iic_master_send_receive (sci_iic_info_t * p_sci_iic_info, sci_iic_api_mode_t api_mode);
static sci_iic_return_t sci_iic_advance (sci_iic_info_t * p_sci_iic_info);
static void sci_iic_close (sci_iic_info_t * p_sci_iic_info);
static sci_iic_return_t sci_iic_control (sci_iic_info_t * p_sci_iic_info, sci_iic_ctrl_ptn_t ctrl_ptn);
static sci_iic_return_t sci_iic_getstatus (sci_iic_info_t * p_sci_iic_info, sci_iic_mcu_status_t * p_sci_iic_status);

/*----------------------------------------------------------------------------*/
/*  Called from function table                                                */
/*----------------------------------------------------------------------------*/
static sci_iic_return_t sci_iic_func_table (sci_iic_api_event_t event, sci_iic_info_t * p_sci_iic_info);
static sci_iic_return_t sci_iic_init_driver (sci_iic_info_t * p_sci_iic_info);
static sci_iic_return_t sci_iic_generate_start_cond (sci_iic_info_t * p_sci_iic_info);
static sci_iic_return_t sci_iic_after_gen_start_cond (sci_iic_info_t * p_sci_iic_info);
static sci_iic_return_t sci_iic_after_send_slvadr (sci_iic_info_t * p_sci_iic_info);
static sci_iic_return_t sci_iic_write_data_sending (sci_iic_info_t * p_sci_iic_info);
static sci_iic_return_t sci_iic_read_data_receiving (sci_iic_info_t * p_sci_iic_info);
static sci_iic_return_t sci_iic_release (sci_iic_info_t * p_sci_iic_info);
static sci_iic_return_t sci_iic_nack (sci_iic_info_t * p_sci_iic_info);

