renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_sci_iic_rx/src/r_sci_iic_rx.c
/*----------------------------------------------------------------------------*/
/*  Other function                                                            */
/*----------------------------------------------------------------------------*/
static void sci_iic_api_status_init (sci_iic_info_t * p_sci_iic_info);
static void sci_iic_set_internal_status (sci_iic_info_t * p_sci_iic_info, sci_iic_api_status_t new_status);
static void sci_iic_set_ch_status (sci_iic_info_t * p_sci_iic_info, sci_iic_ch_dev_status_t status);
static sci_iic_return_t sci_iic_check_chstatus_start (sci_iic_info_t * p_sci_iic_info);
static sci_iic_return_t sci_iic_check_chstatus_advance (sci_iic_info_t * p_sci_iic_info);
static void sci_iic_disable (sci_iic_info_t * p_sci_iic_info);
static void sci_iic_enable (sci_iic_info_t * p_sci_iic_info);
static bool sci_iic_stop_cond_wait (sci_iic_info_t * p_sci_iic_info);
static bool sci_iic_check_stop_event (sci_iic_info_t * p_sci_iic_info);

static void sci_iic_int_icier_setting (sci_iic_info_t * p_sci_iic_info, uint8_t New_icier);
static void sci_iic_start_cond_generate (sci_iic_info_t * p_sci_iic_info);
static void sci_iic_re_start_cond_generate (sci_iic_info_t * p_sci_iic_info);
static void sci_iic_stop_cond_generate (sci_iic_info_t * p_sci_iic_info);
static void sci_iic_set_sending_data (sci_iic_info_t * p_sci_iic_info, uint8_t * p_data);
static uint8_t sci_iic_get_receiving_data (sci_iic_info_t * p_sci_iic_info);
static void sci_iic_iic_disable (sci_iic_info_t * p_sci_iic_info);
static void sci_iic_iic_enable (sci_iic_info_t * p_sci_iic_info);
static void sci_iic_register_init_setting (sci_iic_info_t * p_sci_iic_info);
static void sci_iic_reset_setting (sci_iic_info_t * p_sci_iic_info);

/*----------------------------------------------------------------------------*/
/*   Function table                                                           */
/*----------------------------------------------------------------------------*/
static const sci_iic_mtx_t gc_sci_iic_mtx_tbl[SCI_IIC_STS_MAX][SCI_IIC_EV_MAX] =
{
    /* Uninitialized state (sts0) */
    {
        { SCI_IIC_EV_INIT, sci_iic_init_driver }, /* IIC Driver Initialization */
        { SCI_IIC_EV_GEN_START_COND, NULL }, /* Start Condition Generation */
        { SCI_IIC_EV_INT_START, NULL }, /* Start Condition Generation Interrupt */
        { SCI_IIC_EV_INT_ADD, NULL }, /* Address Sending Interrupt */
        { SCI_IIC_EV_INT_SEND, NULL }, /* Data Sending Interrupt */
        { SCI_IIC_EV_INT_STOP, NULL }, /* Stop Condition Generation Interrupt */
        { SCI_IIC_EV_INT_NACK, NULL }, /* No Acknowledge Interrupt */
},

    /* Idle state (sts1)*/
    {
        { SCI_IIC_EV_INIT, NULL }, /* IIC Driver Initialization */
        { SCI_IIC_EV_GEN_START_COND, sci_iic_generate_start_cond }, /* Start Condition Generation */
        { SCI_IIC_EV_INT_START, NULL }, /* Start Condition Generation Interrupt */
        { SCI_IIC_EV_INT_ADD, NULL }, /* Address Sending Interrupt */
        { SCI_IIC_EV_INT_SEND, NULL }, /* Data Sending Interrupt */
        { SCI_IIC_EV_INT_STOP, NULL }, /* Stop Condition Generation Interrupt */
        { SCI_IIC_EV_INT_NACK, NULL }, /* No Acknowledge Interrupt */
    },

    /* Start condition generation completion wait state (sts2)*/
    {
        { SCI_IIC_EV_INIT, NULL }, /* IIC Driver Initialization */
        { SCI_IIC_EV_GEN_START_COND, NULL }, /* Start Condition Generation */
        { SCI_IIC_EV_INT_START, sci_iic_after_gen_start_cond }, /* Start Condition Generation Interrupt */
        { SCI_IIC_EV_INT_ADD, NULL }, /* Address Sending Interrupt */
        { SCI_IIC_EV_INT_SEND, NULL }, /* Data Sending Interrupt */
        { SCI_IIC_EV_INT_STOP, NULL }, /* Stop Condition Generation Interrupt */
        { SCI_IIC_EV_INT_NACK, sci_iic_nack }, /* No Acknowledge Interrupt */
    },

    /* Slave address [Write] transmission completion wait state (sts3)*/
    {
        { SCI_IIC_EV_INIT, NULL }, /* IIC Driver Initialization */
        { SCI_IIC_EV_GEN_START_COND, NULL }, /* Start Condition Generation */
        { SCI_IIC_EV_INT_START, NULL }, /* Start Condition Generation Interrupt */
        { SCI_IIC_EV_INT_ADD, sci_iic_after_send_slvadr }, /* Address Sending Interrupt */
        { SCI_IIC_EV_INT_SEND, NULL }, /* Data Sending Interrupt */
        { SCI_IIC_EV_INT_STOP, NULL }, /* Stop Condition Generation Interrupt */
        { SCI_IIC_EV_INT_NACK, sci_iic_nack }, /* No Acknowledge Interrupt */
    },

    /* Slave address [Read] transmission completion wait state (sts4) */
    {
        { SCI_IIC_EV_INIT, NULL }, /* IIC Driver Initialization */
        { SCI_IIC_EV_GEN_START_COND, NULL }, /* Start Condition Generation */
        { SCI_IIC_EV_INT_START, NULL }, /* Start Condition Generation Interrupt */
        { SCI_IIC_EV_INT_ADD, sci_iic_after_send_slvadr }, /* Address Sending Interrupt */
        { SCI_IIC_EV_INT_SEND, NULL }, /* Data Sending Interrupt */
        { SCI_IIC_EV_INT_STOP, NULL }, /* Stop Condition Generation Interrupt */
        { SCI_IIC_EV_INT_NACK, sci_iic_nack }, /* No Acknowledge Interrupt */
    },

    /* Data transmission completion wait state (sts5)*/
    {
        { SCI_IIC_EV_INIT, NULL }, /* IIC Driver Initialization */
        { SCI_IIC_EV_GEN_START_COND, NULL }, /* Start Condition Generation */
        { SCI_IIC_EV_INT_START, NULL }, /* Start Condition Generation Interrupt */
        { SCI_IIC_EV_INT_ADD, NULL }, /* Address Sending Interrupt */
        { SCI_IIC_EV_INT_SEND, sci_iic_write_data_sending }, /* Data Sending Interrupt */
        { SCI_IIC_EV_INT_STOP, NULL }, /* Stop Condition Generation Interrupt */
        { SCI_IIC_EV_INT_NACK, sci_iic_nack }, /* No Acknowledge Interrupt */
    },

    /* Data reception completion wait state (sts6)*/
    {
        { SCI_IIC_EV_INIT, NULL }, /* IIC Driver Initialization */
        { SCI_IIC_EV_GEN_START_COND, NULL }, /* Start Condition Generation */
        { SCI_IIC_EV_INT_START, NULL }, /* Start Condition Generation Interrupt */
        { SCI_IIC_EV_INT_ADD, sci_iic_read_data_receiving }, /* Address Sending Interrupt */
        { SCI_IIC_EV_INT_SEND, NULL }, /* Data Sending Interrupt */
        { SCI_IIC_EV_INT_STOP, NULL }, /* Stop Condition Generation Interrupt */
        { SCI_IIC_EV_INT_NACK, sci_iic_nack }, /* No Acknowledge Interrupt */
    },

    /* Stop condition generation completion wait state (sts7) */
    {
        { SCI_IIC_EV_INIT, NULL }, /* IIC Driver Initialization */
        { SCI_IIC_EV_GEN_START_COND, NULL }, /* Start Condition Generation */
        { SCI_IIC_EV_INT_START, NULL }, /* Start Condition Generation Interrupt */
        { SCI_IIC_EV_INT_ADD, NULL }, /* Address Sending Interrupt */
        { SCI_IIC_EV_INT_SEND, NULL }, /* Data Sending Interrupt */
        { SCI_IIC_EV_INT_STOP, sci_iic_release }, /* Stop Condition Generation Interrupt */
        { SCI_IIC_EV_INT_NACK, sci_iic_nack }, /* No Acknowledge Interrupt */
    },
};

