renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_sci_iic_rx/src/r_sci_iic_rx.c
/*----------------------------------------------------------------------------*/
/*   SCI IIC channel status                                                   */
/*----------------------------------------------------------------------------*/
volatile sci_iic_ch_dev_status_t g_sci_iic_ChStatus[SCI_IIC_NUM_CH_MAX]; /* Channel status */

/***********************************************************************************************************************
 * Function Name: R_SCI_IIC_Open
 ******************************************************************************************************************/ /**
 * @brief The function initializes the simple I2C FIT module. This function must be called before calling any other API 
 *        functions.
 * @param[in,out] *p_sci_iic_info
 *             This is the pointer to the I2C communication information structure.\n
 *             Only the member of the structure used in this function is described here.\n
 *             The contents of the structure are referred and updated during communication. Do not rewrite the structure
 *             during communication (SCI_IIC_COMMUNICATION).
 * @retval    SCI_IIC_SUCCESS: Processing completed successfully
 * @retval    SCI_IIC_ERR_LOCK_FUNC: The API is locked by the other task.
 * @retval    SCI_IIC_ERR_INVALID_CHAN: Nonexistent channel
 * @retval    SCI_IIC_ERR_INVALID_ARG: Invalid parameter
 * @retval    SCI_IIC_ERR_OTHER: The event occurred is invalid in the current state.
 * @details   Performs the initialization to start the simple I2C-bus communication. Sets the SCI channel specified by 
 *            the parameter. If the state of the channel is 'uninitialized (SCI_IIC_NO_INIT)', the following processes
 *            are performed.\n
 *            \- Setting the state flag\n
 *            \- Setting I/O ports\n
 *            \- Allocating I2C output ports\n
 *            \- Cancelling SCI module-stop state\n
 *            \- Initializing variables used by the API\n
 *            \- Initializing the SCI registers used for the simple I2C-bus communication\n
 *            \- Disabling the SCI interrupt\n\n
 *            The bit rate set in initial setting to start simple I2C-bus communication.\n
 *            The bit rate is set based on the setting value of "2.7 Configuration Overview" in the application note and
 *            the clock setting definition value specified by BSP FIT module.
 * @note      None
*/
sci_iic_return_t R_SCI_IIC_Open (sci_iic_info_t * p_sci_iic_info)
{
    bool chk;
    sci_iic_return_t ret;

#if (1 == SCI_IIC_CFG_PARAM_CHECKING_ENABLE)
    /* ---- CHECK ARGUMENTS ---- */
    ret = r_sci_iic_check_arguments(p_sci_iic_info, SCI_IIC_MODE_OPEN);

    if (SCI_IIC_SUCCESS != ret)
    {
        return ret;
    }
#endif

    /*  ---- SCI_IIC HARDWARE LOCK ---- */
    chk = R_BSP_HardwareLock(g_sci_iic_handles[p_sci_iic_info->ch_no]->prom->hd_lock);

    if (false == chk)
    {
        /* Lock has already been acquired by another task. Needs to try again later. */
        return SCI_IIC_ERR_LOCK_FUNC;
    }

    /* ---- INITIALIZE SCI_IIC INTERNAL STATUS INFORMATION ---- */
    g_sci_iic_ChStatus[p_sci_iic_info->ch_no] = SCI_IIC_NO_INIT;
    p_sci_iic_info->dev_sts = SCI_IIC_NO_INIT;

    /* ---- INITIALIZE CHANNEL ---- */
    /* Calls the API function. */
    ret = sci_iic_open(p_sci_iic_info);

    return ret;
} /* End of function R_SCI_IIC_Open() */

/***********************************************************************************************************************
 * Function Name: sci_iic_open
 * Description  : Initializes the SCI_IIC driver.
 *              : Initializes the I/O register for SCI_IIC control.
 * Arguments    : sci_iic_info_t * p_sci_iic_info    ; IIC Information
 **********************************************************************************************************************/
static sci_iic_return_t sci_iic_open (sci_iic_info_t * p_sci_iic_info)
{
    sci_iic_return_t ret;
#if SCI_IIC_CFG_PORT_SETTING_PROCESSING
    R_BSP_VOLATILE_EVENACCESS const sci_iic_ch_rom_t * prom = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom;
    uint8_t sscl_port_gr;
    uint8_t sscl_port_pin;
    uint8_t ssda_port_gr;
    uint8_t ssda_port_pin;
#endif

    /* Updates the channel status. */
    sci_iic_set_ch_status(p_sci_iic_info, SCI_IIC_IDLE);

#if SCI_IIC_CFG_PORT_SETTING_PROCESSING
    /* Ports open setting :Sets ports to input mode, Ports input pull-up becomes "Off".*/
    /* Includes I/O register read operation at the end of the following function. */
    /* Set N-channel open-drain output */
    /* Disables SCI_IIC multi-function pin controller after setting SCL and SDA to Hi-z. */
    /* Includes I/O register read operation at the end of the following function. */
    /* Set Hi-z */
    sscl_port_gr = prom->sscl_port_gr;
    sscl_port_pin = prom->sscl_port_pin;
    ssda_port_gr = prom->ssda_port_gr;
    ssda_port_pin = prom->ssda_port_pin;
    r_sci_iic_io_open(sscl_port_gr, sscl_port_pin);
    r_sci_iic_mpc_setting(sscl_port_gr, sscl_port_pin, SCI_IIC_MPC_SSCL_INIT);
    r_sci_iic_io_open(ssda_port_gr, ssda_port_pin);
    r_sci_iic_mpc_setting(ssda_port_gr, ssda_port_pin, SCI_IIC_MPC_SSDA_INIT);
#endif

    /* Enables the IIC peripheral registers. */
    /* Includes I/O register read operation at the end of the following function. */
    r_sci_iic_power_on(p_sci_iic_info->ch_no);

    sci_iic_register_init_setting(p_sci_iic_info);

    /* Initialize variables to check bus busy. */
    g_sci_iic_handles[p_sci_iic_info->ch_no]->mode = SCI_IIC_STPREQ;

    /* Initialize API status on RAM */
    sci_iic_api_status_init(p_sci_iic_info);

    /* Sets the internal status. (Internal information initialization) */
    sci_iic_set_internal_status(p_sci_iic_info, SCI_IIC_STS_NO_INIT);

    /* Initializes the IIC driver. */
    ret = sci_iic_func_table(SCI_IIC_EV_INIT, p_sci_iic_info);

    if (SCI_IIC_SUCCESS != ret)
    {
        /* Updates the channel status. */
        sci_iic_set_ch_status(p_sci_iic_info, SCI_IIC_NO_INIT);
    }

    /* Disables IIC. */
    sci_iic_disable(p_sci_iic_info);

    return ret;
} /* End of function sci_iic_open() */

