renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_sci_iic_rx/src/r_sci_iic_rx.c
/***********************************************************************************************************************
 * Function Name: R_SCI_IIC_MasterSend
 ******************************************************************************************************************/ /**
 * @brief Starts master transmission. Changes the transmit pattern according to the parameters. Operates batched 
 *        processing until stop condition generation.
 * @param[in] *p_sci_iic_info
 *             This is the pointer to the I2C communication information structure. The transmit patterns can be selected
 *             from four patterns by the parameter. Refer to the Special Notes in this section for available settings 
 *             and the setting values for each transmit pattern.\n
 *             Only members of the structure used in this function are described here.\n
 *             The contents of the structure are referred and updated during communication. Do not rewrite the structure
 *             during communication (SCI_IIC_COMMUNICATION).\n
 *             When setting the slave address, store it without shifting 1 bit to left.\n
 * @retval    SCI_IIC_SUCCESS: Processing completed successfully
 * @retval    SCI_IIC_ERR_INVALID_CHAN: The channel is nonexistent.
 * @retval    SCI_IIC_ERR_INVALID_ARG: The parameter is invalid.
 * @retval    SCI_IIC_ERR_NO_INIT: Uninitialized state
 * @retval    SCI_IIC_ERR_BUS_BUSY: The bus state is busy.
 * @retval    SCI_IIC_ERR_OTHER: The event occurred is invalid in the current state.
 * @details   Starts the simple I2C-bus master transmission. The transmission is performed with the SCI channel and 
 *            transmit pattern specified by parameters. If the state of the channel is 'idle (SCI_IIC_IDEL)', the
 *            following processes are performed.\n
 *            \- Setting the state flag\n
 *            \- Initializing variables used by the API\n
 *            \- Enabling the SCI interrupts\n
 *            \- Releasing the I2C reset\n
 *            \- Allocating I2C output ports\n
 *            \- Generating a start condition\n\n
 *            This function returns SCI_IIC_SUCCESS as a return value when the processing up to the start condition 
 *            generation ends normally. This function returns SCI_IIC_ERR_BUS_BUSY as a return value when the following 
 *            conditions are met to the start condition generation ends normally.(Note.1)\n
 *            \- Either SCL or SDA line is in low state.\n\n
 *            The transmission processing is performed sequentially in subsequent interrupt processing after this 
 *            function return SCI_IIC_SUCCESS. See Section "2.4 Usage of Interrupt Vector" in the application note
 *            should be refered for the interrupt to be used. For master transmission, the interrupt generation timing
 *            should be refered from "6.2.1 Master transmission" in the application note.\n
 *            After issuing a stop condition at the end of transmission, the callback function specified by the argument
 *            is called.\n
 *            The transmission completion is performed normally or not, can be confirmed by checking the device status 
 *            flag specified by the argument or the channel status flag g_sci_iic_ChStatus [], that is to be 
 *            "SCI_IIC_FINISH" for normal completion.\n
 *            Notes:
 *            -# When SCL and SDA pin is not external pull-up, this function may return SCI_IIC_ERR_BUS_BUSY by
 *            detecting either SCL or SDA line is as in low state.
 * @note      Available settings for each pattern see Section 3.2 in the application note for details.
*/ 
sci_iic_return_t R_SCI_IIC_MasterSend (sci_iic_info_t * p_sci_iic_info)
{
    sci_iic_return_t ret;

#if (1 == SCI_IIC_CFG_PARAM_CHECKING_ENABLE)
    /* ---- CHECK ARGUMENTS ---- */
    ret = r_sci_iic_check_arguments(p_sci_iic_info, SCI_IIC_MODE_SEND);

    if (SCI_IIC_SUCCESS != ret)
    {
        return ret;
    }
#endif

    /* Calls the API function. */
    ret = sci_iic_master_send_receive(p_sci_iic_info, SCI_IIC_MODE_SEND);

    return ret;
} /* End of function R_SCI_IIC_MasterSend() */

/***********************************************************************************************************************
 * Function Name: R_SCI_IIC_MasterReceive
 ******************************************************************************************************************/ /**
 * @brief Starts master reception. Changes the receive pattern according to the parameters. Operates batched processing 
 *        until stop condition generation.
 * @param[in] *p_sci_iic_info
 *             This is the pointer to the I2C communication information structure. The receive pattern can be selected 
 *             from master reception and master transmit/receive. Refer to the Special Notes in this section for 
 *             available settings and the setting values for each receive pattern.\n
 *             Only members of the structure used in this function are described here.\n
 *             The contents of the structure are referred and updated during communication. Do not rewrite the structure
 *             during communication (SCI_IIC_COMMUNICATION).\n
 *             When setting the slave address, store it without shifting 1 bit to left.\n
 * @retval    SCI_IIC_SUCCESS: Processing completed successfully
 * @retval    SCI_IIC_ERR_INVALID_CHAN: The channel is nonexistent.
 * @retval    SCI_IIC_ERR_INVALID_ARG: The parameter is invalid.
 * @retval    SCI_IIC_ERR_NO_INIT: Uninitialized state
 * @retval    SCI_IIC_ERR_BUS_BUSY: The bus state is busy.
 * @retval    SCI_IIC_ERR_OTHER: The event occurred is invalid in the current state.
 * @details   Starts the simple I2C-bus master reception. The reception is performed with the SCI channel and receive 
 *            pattern specified by parameters. If the state of the channel is 'idle (SCI_IIC_IDEL)', the following
 *            processes are performed.\n
 *            \- Setting the state flag\n
 *            \- Initializing variables used by the API\n
 *            \- Enabling the SCI interrupts\n
 *            \- Releasing the I2C reset\n
 *            \- Allocating I2C output ports\n
 *            \- Generating a start condition\n\n
 *            This function returns SCI_IIC_SUCCESS as a return value when the processing up to the start condition 
 *            generation ends normally. This function returns SCI_IIC_ERR_BUS_BUSY as a return value when the following 
 *            conditions are met to the start condition generation ends normally.(Note.1)\n
 *            \- Either SCL or SDA line is in low state.\n\n
 *            The reception processing is performed sequentially in subsequent interrupt processing after this function 
 *            return SCI_IIC_SUCCESS. See section "2.4 Usage of Interrupt Vector" in the application note should be
 *            refered for the interrupt to be used. For master transmission, the interrupt generation timing should be
 *            refered from "6.2.2 Master Reception" in the application note.\n
 *            After issuing a stop condition at the end of transmission, the callback function specified by the argument
 *            is called.\n
 *            The reception completion is performed normally or not, can be confirmed by checking the device status flag
 *            specified by the argument or the channel status flag g_sci_iic_ChStatus [], that is to be "SCI_IIC_FINISH"
 *            for normal completion.\n
 *            Notes:
 *            -# When SCL and SDA pin is not external pull-up, this function may return SCI_IIC_ERR_BUS_BUSY by
 *            detecting either SCL or SDA line is as in low state.
 * @note      Available settings for each pattern see Section 3.3 in the application note for details.
*/
sci_iic_return_t R_SCI_IIC_MasterReceive (sci_iic_info_t * p_sci_iic_info)
{
    sci_iic_return_t ret;

