renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_sci_iic_rx/src/r_sci_iic_rx.c
#if (1 == SCI_IIC_CFG_PARAM_CHECKING_ENABLE)
    /* ---- CHECK ARGUMENTS ---- */
    ret = r_sci_iic_check_arguments(p_sci_iic_info, SCI_IIC_MODE_RECEIVE);

    if (SCI_IIC_SUCCESS != ret)
    {
        return ret;
    }
#endif

    /* cnt1st is NULL -> Master Receive */
    if (0 == p_sci_iic_info->cnt1st)
    {
        /* Master Receive */
        /* Calls the API function. */
        ret = sci_iic_master_send_receive(p_sci_iic_info, SCI_IIC_MODE_RECEIVE);
    }
    else
    {
        /* Master Transmission Reception */
        /* Calls the API function. */
        ret = sci_iic_master_send_receive(p_sci_iic_info, SCI_IIC_MODE_SEND_RECEIVE);
    }

    return ret;
} /* End of function R_SCI_IIC_MasterReceive() */

/***********************************************************************************************************************
 * Function Name: sci_iic_master_send_receive
 * Description  : Master transmission start processing.
 *                Generates the start condition. Starts the master transmission.
 * Arguments    : sci_iic_info_t * p_sci_iic_info    ; IIC Information
 *              ; sci_iic_api_mode_t api_mode        ; Internal Mode
 **********************************************************************************************************************/
static sci_iic_return_t sci_iic_master_send_receive (sci_iic_info_t * p_sci_iic_info, sci_iic_api_mode_t api_mode)
{
    sci_iic_return_t ret;

    /* Checks the channel status. */
    ret = sci_iic_check_chstatus_start(p_sci_iic_info);

    if (SCI_IIC_SUCCESS != ret)
    {
        return ret;
    }

    g_sci_iic_handles[p_sci_iic_info->ch_no]->psci_iic_info_ch = p_sci_iic_info;

    /* Updates the channel status. */
    sci_iic_set_ch_status(p_sci_iic_info, SCI_IIC_COMMUNICATION);

    /* ---- Initialize API status on RAM ---- */
    sci_iic_api_status_init(p_sci_iic_info);

    /* Sets the internal mode. */
    g_sci_iic_handles[p_sci_iic_info->ch_no]->api_mode = api_mode;

    /* Enables IIC. */
    sci_iic_enable(p_sci_iic_info);

    /* Generates the start condition. */
    ret = sci_iic_func_table(SCI_IIC_EV_GEN_START_COND, p_sci_iic_info);

    if (SCI_IIC_SUCCESS != ret)
    {
        /* Disables IIC. */
        sci_iic_disable(p_sci_iic_info);

        /* Updates the channel status. */
        sci_iic_set_ch_status(p_sci_iic_info, SCI_IIC_IDLE);
    }

    return ret;
} /* End of function sci_iic_master_send_receive() */

/***********************************************************************************************************************
 * Function Name: R_SCI_IIC_GetStatus
 ******************************************************************************************************************/ /**
 * @brief Returns the state of this module.
 * @param[in] *p_sci_iic_info
 *             This is the pointer to the I2C communication information structure.\n
 *             Only the member of the structure used in this function is described here.
 * @param[in] *p_sci_iic_status
 *             This contains the address to store the I2C state flag. If the argument is 'FIT_NO_PTR', the state is not
 *             returned.
 * @retval    SCI_IIC_SUCCESS: Processing completed successfully
 * @retval    SCI_IIC_ERR_INVALID_CHAN: The channel is nonexistent.
 * @retval    SCI_IIC_ERR_INVALID_ARG: The parameter is invalid.
 * @retval    SCI_IIC_ERR_OTHER: The event occurred is invalid in the current state.
 * @details   Returns the state of this module.
 *            By reading the register, pin level, variable, or others, obtains the state of the SCI channel which 
 *            specified by the parameter, and returns the obtained state as 32-bit structure. 
 * @note      See section "3.5 R_SCI_IIC_GetStatus()" in the application note for details.
*/
sci_iic_return_t R_SCI_IIC_GetStatus (sci_iic_info_t *p_sci_iic_info, sci_iic_mcu_status_t *p_sci_iic_status)
{
    sci_iic_return_t ret;

#if (1 == SCI_IIC_CFG_PARAM_CHECKING_ENABLE)
    /* ---- CHECK ARGUMENTS ---- */
    ret = r_sci_iic_check_arguments(p_sci_iic_info, SCI_IIC_MODE_GETSTATUS);

    if (SCI_IIC_SUCCESS != ret)
    {
        return ret;
    }
#endif

    /* Calls the API function. */
    ret = sci_iic_getstatus(p_sci_iic_info, p_sci_iic_status);

    return ret;
} /* End of function R_SCI_IIC_GetStatus() */

/***********************************************************************************************************************
 * Function Name: sci_iic_getstatus
 * Description  : Returns the state of this module.
 *                Obtains the state of the SCI channel, which specified by the parameter,
 *                by reading the register, variable, or others, and returns
 *                the obtained state as 32-bit structure.
 * Arguments    : sci_iic_info_t * p_sci_iic_info        ; IIC Information
 *                sci_iic_mcu_status_t * p_sci_iic_status; The address to store the I2C state flag.
 **********************************************************************************************************************/
static sci_iic_return_t sci_iic_getstatus (sci_iic_info_t * p_sci_iic_info, sci_iic_mcu_status_t * p_sci_iic_status)
{
    sci_iic_mcu_status_t sts_flag;
    sci_regs_t pregs = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom->regs;
    R_BSP_VOLATILE_EVENACCESS uint8_t * const ppidr = SCI_IIC_PRV_PIDR_BASE_REG;
    R_BSP_VOLATILE_EVENACCESS const sci_iic_ch_rom_t * prom = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom;
    
    uint8_t sscl_port_gr;
    uint8_t sscl_port_pin;
    uint8_t ssda_port_gr;
    uint8_t ssda_port_pin;

    /* ---- Check Bus state ---- */
    if (SCI_IIC_STPREQ != g_sci_iic_handles[p_sci_iic_info->ch_no]->mode)
    {
        sts_flag.BIT.BSY = 1;
    }
    else
    {
        sts_flag.BIT.BSY = 0;
    }

    /* ---- Check Mode ---- */
    if (SCI_IIC_MODE_SEND == g_sci_iic_handles[p_sci_iic_info->ch_no]->api_mode)
    {
        /* Transmit */
        sts_flag.BIT.TRS = 1;
    }
    else if ((SCI_IIC_MODE_RECEIVE == g_sci_iic_handles[p_sci_iic_info->ch_no]->api_mode)
            || (SCI_IIC_MODE_SEND_RECEIVE == g_sci_iic_handles[p_sci_iic_info->ch_no]->api_mode))
    {
        /* Receive */
        sts_flag.BIT.TRS = 0;
    }
    else
    {
        sts_flag.BIT.TRS = 0;
    }

    /* ---- Check Event detection ---- */
    /* SISR - I2C Status Register 
     b7:b6 - Reserved - These bits are read as 0.
     b5:b4 - Reserved - The read value is undefined.
     b3    - Reserved - These bits are read as 0.
     b2    - Reserved - The read value is undefined.
     b1    - Reserved - These bits are read as 0.
     b0    - IICACKR  - ACK Reception Data Flag  */
    if (1 == pregs->SISR.BIT.IICACKR)
    {
        /* NACK translation detected */
        sts_flag.BIT.NACK = 1;
    }
    else
    {
        /* Not detected */
        sts_flag.BIT.NACK = 0;
    }

    /* Check SSCL Pin level */
    sscl_port_gr = prom->sscl_port_gr;
    sscl_port_pin = prom->sscl_port_pin;
    if (SCI_IIC_LOW == ((*(ppidr + sscl_port_gr)) & (1U << sscl_port_pin)))
    {
        sts_flag.BIT.SCLI = 0;
    }
    else
    {
        sts_flag.BIT.SCLI = 1;
    }

