renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_sci_iic_rx/src/r_sci_iic_rx.c
    /* Check SSDA Pin level */
    ssda_port_gr = prom->ssda_port_gr;
    ssda_port_pin = prom->ssda_port_pin;
    if (SCI_IIC_LOW == ((*(ppidr + ssda_port_gr)) & (1U << ssda_port_pin)))
    {
        sts_flag.BIT.SDAI = 0;
    }
    else
    {
        sts_flag.BIT.SDAI = 1;
    }

    sts_flag.BIT.rsv = 0;

    /* ---- Set the state ---- */
    (*p_sci_iic_status) = sts_flag;

    return SCI_IIC_SUCCESS;
} /* End of function sci_iic_getstatus() */

/***********************************************************************************************************************
 * Function Name: R_SCI_IIC_Control
 ******************************************************************************************************************/ /**
 * @brief This function outputs conditions, Hi-Z from the SSDA pin, and one-shot of the SSCL clock. Also it resets the 
 *        settings of this module. This function is mainly used when a communication error occurs.
 * @param[in] *p_sci_iic_info
 *             This is the pointer to the I2C communication information structure.\n
 *             Only the member of the structure used in this function is described here.\n
 *             The contents of the structure are referred and updated during communication. Do not rewrite the structure
 *             during communication (SCI_IIC_COMMUNICATION).\n
 *             For the parameter which has '(to be updated)' in the comment below, the argument for the parameter will
 *             be updated during the API execution. 
 * @param[in] ctrl_ptn
 *             Specifies the output pattern. When selecting multiple options, specify them with '|'.\n
 *             The following options can be selected simultaneously:\n
 *             \- The following three options can be specified simultaneously. Then they will be processed in the order
 *                listed.\n
 *                \li SCI_IIC_GEN_START_CON
 *                \li SCI_IIC_GEN_RESTART_CON
 *                \li SCI_IIC_GEN_STOP_CON
 *
 *             \- The following two options can be specified simultaneously.\n
 *                \li SCI_IIC_GEN_SDA_HI_Z
 *                \li SCI_IIC_GEN_SSCL_ONESHOT
 * @retval    SCI_IIC_SUCCESS: Processing completed successfully
 * @retval    SCI_IIC_ERR_INVALID_CHAN: The channel is nonexistent.
 * @retval    SCI_IIC_ERR_INVALID_ARG: The parameter is invalid.
 * @retval    SCI_IIC_ERR_BUS_BUSY: The bus state is busy.
 * @retval    SCI_IIC_ERR_OTHER: The event occurred is invalid in the current state.
 * @details   Outputs control signals of the simple I2C mode. Outputs conditions specified by the argument, Hi-Z from 
 *            the SSDA pin, and one-shot of the SSCL clock. Also resets the simple I2C mode settings.
 * @note      None
*/
sci_iic_return_t R_SCI_IIC_Control (sci_iic_info_t * p_sci_iic_info, sci_iic_ctrl_ptn_t ctrl_ptn)
{
    sci_iic_return_t ret;

#if (1 == SCI_IIC_CFG_PARAM_CHECKING_ENABLE)
    /* ---- CHECK ARGUMENTS ---- */
    ret = r_sci_iic_check_arguments(p_sci_iic_info, SCI_IIC_MODE_CONTROL);

    if (SCI_IIC_SUCCESS != ret)
    {
        return ret;
    }

    if (SCI_IIC_GEN_ERR_CON == ctrl_ptn)
    {
        return SCI_IIC_ERR_INVALID_ARG;
    }

#endif

    /* Calls the API function. */
    ret = sci_iic_control(p_sci_iic_info, ctrl_ptn);

    return ret;
} /* End of function R_SCI_IIC_Control() */

/***********************************************************************************************************************
 * Function Name: sci_iic_control
 * Description  : This function is mainly used when a communication error occurs.
 *                Outputs control signals of the simple I2C mode.
 *                Outputs conditions specified by the argument, NACK,
 *                and one-shot of the SSCL clock. Also resets the simple I2C mode settings.
 * Arguments    : sci_iic_info_t * p_sci_iic_info   ; IIC Information
 *                sci_iic_ctrl_ptn_t ctrl_ptn       ; Output Pattern
 **********************************************************************************************************************/
static sci_iic_return_t sci_iic_control (sci_iic_info_t * p_sci_iic_info, sci_iic_ctrl_ptn_t ctrl_ptn)
{
    volatile uint32_t cnt;
    volatile uint32_t i;
    sci_iic_return_t ret = SCI_IIC_SUCCESS;
    sci_regs_t pregs = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom->regs;
    R_BSP_VOLATILE_EVENACCESS uint8_t * const ppidr = SCI_IIC_PRV_PIDR_BASE_REG;
    R_BSP_VOLATILE_EVENACCESS const sci_iic_ch_rom_t * prom = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom;

    uint8_t sscl_port_gr;
    uint8_t sscl_port_pin;
    uint8_t ssda_port_gr;
    uint8_t ssda_port_pin;
    
    /* Enable Simple IIC mode */
    /* Enables SCI_IIC multi-function pin controller.*/
    sci_iic_iic_enable(p_sci_iic_info);

    /* Disable interrupt */
    r_sci_iic_int_disable(p_sci_iic_info);

    if ((0 != (ctrl_ptn & ((SCI_IIC_GEN_START_CON | SCI_IIC_GEN_RESTART_CON) | SCI_IIC_GEN_STOP_CON)))
            && (0 == (ctrl_ptn & ((SCI_IIC_GEN_SSDA_HI_Z | SCI_IIC_GEN_SSCL_ONESHOT) | SCI_IIC_GEN_RESET))))
    {
        /* ==== Check request output pattern ==== */
        /* ---- Generate the start condition ---- */
        if ((ctrl_ptn & SCI_IIC_GEN_START_CON) == SCI_IIC_GEN_START_CON)
        {

            sscl_port_gr = prom->sscl_port_gr;
            sscl_port_pin = prom->sscl_port_pin;
            ssda_port_gr = prom->ssda_port_gr;
            ssda_port_pin = prom->ssda_port_pin;
            if ((SCI_IIC_LOW == ((*(ppidr + sscl_port_gr)) & (1U << sscl_port_pin)))
                    || (SCI_IIC_LOW == ((*(ppidr + ssda_port_gr)) & (1U << ssda_port_pin))))
            {
                /* When BBSY bit is "1"(Bus busy) */
                ret = SCI_IIC_ERR_BUS_BUSY;
                return ret;
            }

            /* Generates the start condition. */
            /* SCR - Serial Control Register
             b7     TIE - Transmit Interrupt Enable
             b6     RIE - Receive Interrupt Enable
             b5     TE - Transmit Enable - Serial transmission is enabled.
             b4     RE - Receive Enable - Serial reception is enabled.
             b3     MPIE - Multi-Processor Interrupt Enable
             b2     TEIE  - Transmit End Interrupt Enable
             b1:b0  CKE - Clock Enable*/
            pregs->SCR.BYTE |= SCI_IIC_SCR_TE_RE;

            /* SIMR3 - I2C Mode Register 3
             b7:b6  IICSCLS - SSCL Output Select - Generate a start, restart, or stop condition.
             b5:b4  IICSDAS - SSDA Output Select - Generate a start, restart, or stop condition.
             b3     IICSTIF - Issuing of Start, Restart, or Stop Condition Completed Flag
             - There are no requests for generating conditions
             b0     IICSTAREQ - Start Condition Generation - A start condition is generated. */
            pregs->SIMR3.BYTE = SCI_IIC_ST_CON_GENERATED;

            /* Wait the request generation has been completed */
            i = SCI_IIC_CFG_BUS_CHECK_COUNTER;

            /* WAIT_LOOP */
            while (1 != pregs->SIMR3.BIT.IICSTIF)
            {
                /* Check Reply */
                if (0U < i)
                {
                    i--;
                }
                else
                {
                    /* When None Reply */
                    ret = SCI_IIC_ERR_OTHER;
                    return ret;
                }

