renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_sci_iic_rx/src/r_sci_iic_rx.c
            }

            pregs->SIMR3.BIT.IICSTIF = SCI_IIC_IICSTIF_CLEAR;

            /* WAIT_LOOP */
            while (SCI_IIC_IICSTIF_CLEAR != pregs->SIMR3.BIT.IICSTIF)
            {
                /* nothing to do */
            }

        }

        /* ---- Generate the restart condition ---- */
        if ((ctrl_ptn & SCI_IIC_GEN_RESTART_CON) == SCI_IIC_GEN_RESTART_CON)
        {
            /* Generates the restart condition. */
            /* SCR - Serial Control Register
             b5     TE - Transmit Enable - Serial transmission is enabled.
             b4     RE - Receive Enable - Serial reception is enabled. */
            pregs->SCR.BYTE |= SCI_IIC_SCR_TE_RE;

            /* SIMR3 - I2C Mode Register 3
             b1     IIRSTAREQ - Restart Condition Generation - A start condition is generated. */
            pregs->SIMR3.BYTE = SCI_IIC_RST_CON_GENERATED;

            /* Wait the request generation has been completed */
            i = SCI_IIC_CFG_BUS_CHECK_COUNTER;
            
            /* WAIT_LOOP */
            while (1 != pregs->SIMR3.BIT.IICSTIF)
            {
                /* Check Reply */
                if (0U < i)
                {
                    i--;
                }
                else
                {
                    /* When None Reply */
                    ret = SCI_IIC_ERR_OTHER;
                    return ret;
                }

            }

            pregs->SIMR3.BIT.IICSTIF = SCI_IIC_IICSTIF_CLEAR;

            /* WAIT_LOOP */
            while (SCI_IIC_IICSTIF_CLEAR != pregs->SIMR3.BIT.IICSTIF)
            {
                /* nothing to do */
            }

        }

        /* ---- Generate the stop condition ---- */
        if ((ctrl_ptn & SCI_IIC_GEN_STOP_CON) == SCI_IIC_GEN_STOP_CON)
        {
            /* Generates the stop condition. */
            /* SCR - Serial Control Register
             b5     TE - Transmit Enable - Serial transmission is enabled.
             b4     RE - Receive Enable - Serial reception is enabled. */
            pregs->SCR.BYTE |= SCI_IIC_SCR_TE_RE;

            /* SIMR3 - I2C Mode Register 3
             b2     IISTPREQ - Stop Condition Generation - A start condition is generated. */
            pregs->SIMR3.BYTE = SCI_IIC_SP_CON_GENERATED;

            /* Wait the request generation has been completed */
            i = SCI_IIC_CFG_BUS_CHECK_COUNTER;
    
            /* WAIT_LOOP */
            while (1 != pregs->SIMR3.BIT.IICSTIF)
            {
                /* Check Reply */
                if (0U < i)
                {
                    i--;
                }
                else
                {
                    /* When None Reply */
                    ret = SCI_IIC_ERR_OTHER;
                    return ret;
                }

            }

            pregs->SIMR3.BIT.IICSTIF = SCI_IIC_IICSTIF_CLEAR;

            /* WAIT_LOOP */
            while (SCI_IIC_IICSTIF_CLEAR != pregs->SIMR3.BIT.IICSTIF)
            {
                /* nothing to do */
            }

        }
    }
    else if ((0 != (ctrl_ptn & (SCI_IIC_GEN_SSDA_HI_Z | SCI_IIC_GEN_SSCL_ONESHOT)))
            && (0 == (ctrl_ptn & (((SCI_IIC_GEN_START_CON | SCI_IIC_GEN_RESTART_CON) | SCI_IIC_GEN_STOP_CON) |
            SCI_IIC_GEN_RESET))))
    {

        /* ---- Generate NACK ---- */
        if ((ctrl_ptn & SCI_IIC_GEN_SSDA_HI_Z) == SCI_IIC_GEN_SSDA_HI_Z)
        {
            /* Output NACK */
            /* SIMR3 - I2C Mode Register 3
             b7:b6  IICSCLS - SSCL Output Select - Place the SSCL pin in the high-impedance state.
             b5:b4  IICSDAS - SSDA Output Select - Place the SSDA pin in the high-impedance state. */
            pregs->SIMR3.BIT.IICSDAS = SCI_IIC_HI_Z_OUTPUT; /* SSDAn set Hi-z */
        }

        if (SCI_IIC_GEN_SSCL_ONESHOT == (ctrl_ptn & SCI_IIC_GEN_SSCL_ONESHOT))
        {
            /* ---- Generate OneShot of SSCL clock ---- */
            /* Output from Low to Hi-z */
            /* SIMR3 - I2C Mode Register 3
             b7:b6  IICSCLS - SSCL Output Select - Output the low level on the SSDA pin.
             b5:b4  IICSDAS - SSDA Output Select - Place the SSDA pin in the high-impedance state. */
            pregs->SIMR3.BIT.IICSCLS = SCI_IIC_LOW_OUTPUT;

            /* WAIT_LOOP */
            for (cnt = SCI_IIC_ONESHOT_WAIT; cnt > 0; cnt--)
            {
                /* nothing to do */
            }

            /* SIMR3 - I2C Mode Register 3
             b7:b6  IICSCLS - SSCL Output Select - Place the SSCL pin in the high-impedance state.*/
            pregs->SIMR3.BIT.IICSCLS = SCI_IIC_HI_Z_OUTPUT; /* SSCLn output  Hi-z*/

            /* WAIT_LOOP */
            for (cnt = SCI_IIC_ONESHOT_WAIT; cnt > 0; cnt--)
            {
                /* nothing to do */
            }

        }

    }
    else if ((0 != (ctrl_ptn & SCI_IIC_GEN_RESET))
            && (0 == (ctrl_ptn & ((((SCI_IIC_GEN_START_CON | SCI_IIC_GEN_RESTART_CON) | SCI_IIC_GEN_STOP_CON) |
            SCI_IIC_GEN_SSDA_HI_Z) | SCI_IIC_GEN_SSCL_ONESHOT))))
    {
        /* Reset setting */
        sci_iic_reset_setting(p_sci_iic_info);

        /* ---- Generate Reset ---- */
        ret = sci_iic_open(p_sci_iic_info);
    }
    else
    {
        /* parameter error */
        ret = SCI_IIC_ERR_INVALID_ARG;
    }

    /* Reset cnrl_ptn */
    ctrl_ptn = 0U;

    return ret;
} /* End of function sci_iic_control() */

/***********************************************************************************************************************
 * Function Name: R_SCI_IIC_Close
 ******************************************************************************************************************/ /**
 * @brief This function completes the simple I2C communication and releases the SCI used.
 * @param[in] *p_sci_iic_info
 *             This is the pointer to the I2C communication information structure.\n
 *             Only the member of the structure used in this function is described here.\n
 *             The contents of the structure are referred and updated during communication. Do not rewrite the structure
 *             during communication (SCI_IIC_COMMUNICATION).\n
 *             For the parameter which has '(to be updated)' in the comment below, the argument for the parameter will
 *             be updated during the API execution. 
 * @retval    SCI_IIC_SUCCESS: Processing completed successfully
 * @retval    SCI_IIC_ERR_INVALID_CHAN: The channel is nonexistent.
 * @retval    SCI_IIC_ERR_INVALID_ARG: The parameter is invalid.
 * @details   Configures the settings to complete the simple I2C-bus communication. Disables the SCI channel specified
 *            by the parameter. The following processes are performed in this function.\n
 *            \- Entering the SCI module-stop state\n
 *            \- Releasing I2C output ports\n
 *            \- Disabling the SCI interrupt\n\n
 *            To restart the communication, call the R_SCI_IIC_Open() function (initialization function). If the 
 *            communication is forcibly terminated, that communication is not guaranteed.
 * @note      None
*/
sci_iic_return_t R_SCI_IIC_Close (sci_iic_info_t * p_sci_iic_info)
{
    bool chk;

