renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_sci_iic_rx/src/r_sci_iic_rx.c
                    /* Sets the internal status. */
                    sci_iic_set_internal_status(p_sci_iic_info, SCI_IIC_STS_RECEIVE_DATA_WAIT);

                    /* Performs dummy read. */
                    uctmp = sci_iic_get_receiving_data(p_sci_iic_info);

                    p_sci_iic_info->cnt2nd--;

                    /* Write Dummy date */
                    /* TDR - Transmit Data Register */
                    pregs->TDR = 0xff;

                break;

                default :

                    ret = SCI_IIC_ERR_OTHER;

                break;
            }

        break;

        default :

            ret = SCI_IIC_ERR_OTHER;

        break;

    }

    return ret;
} /* End of function sci_iic_after_send_slvadr() */

/***********************************************************************************************************************
 * Function Name: sci_iic_write_data_sending
 * Description  : After Transmitting Data Processing (Func4).
 *                Performs one of the following processing  according to the state.
 *                Transmits a data. Generates stop condition. Generates restart condition.
 * Arguments    : sci_iic_info_t * p_sci_iic_info    ; IIC Information
 * Return Value : SCI_IIC_SUCCESS                    ; Successful operation, communication state
 *              : SCI_IIC_ERR_OTHER                  ; Other error
 **********************************************************************************************************************/
static sci_iic_return_t sci_iic_write_data_sending (sci_iic_info_t * p_sci_iic_info)
{
    sci_iic_return_t ret = SCI_IIC_SUCCESS;

    /* IIC mode? */
    switch (g_sci_iic_handles[p_sci_iic_info->ch_no]->api_mode)
    {
        case SCI_IIC_MODE_SEND :

            /* Is 1st data pointer set? */
            if ((uint8_t *) FIT_NO_PTR != p_sci_iic_info->p_data1st)
            {
                /* 1st data counter = 0?  */
                if (0U != p_sci_iic_info->cnt1st) /* Pattern 1 of Master Write  */
                {
                    /* Transmits a 1st data. */
                    sci_iic_set_sending_data(p_sci_iic_info, p_sci_iic_info->p_data1st);

                    /* Decreases the 1st data counter. */
                    p_sci_iic_info->cnt1st--;

                    /* Increases the 1st data buffer pointer. */
                    p_sci_iic_info->p_data1st++;

                    return ret;
                }
            }

            /* Is 2nd data pointer set? */
            if ((uint8_t *) FIT_NO_PTR != p_sci_iic_info->p_data2nd)
            {
                /* 2nd data counter = 0? */
                if (0U != p_sci_iic_info->cnt2nd) /* Pattern 2 of Master Write */
                {
                    /* Transmits a 2nd data. */
                    sci_iic_set_sending_data(p_sci_iic_info, p_sci_iic_info->p_data2nd);

                    /* Decreases the 2nd data counter. */
                    p_sci_iic_info->cnt2nd--;

                    /* Increases the 2nd data buffer pointer. */
                    p_sci_iic_info->p_data2nd++;

                    return ret;
                }
            }

            /* Sets the internal status. */
            sci_iic_set_internal_status(p_sci_iic_info, SCI_IIC_STS_SP_COND_WAIT);

            /* Enables the IIC bus interrupt.*/
            sci_iic_int_icier_setting(p_sci_iic_info, SCI_IIC_SCR_ENABLE);

            /* Generates the stop condition. */
            sci_iic_stop_cond_generate(p_sci_iic_info);
        break;

        case SCI_IIC_MODE_SEND_RECEIVE :

            /* Is 1st data pointer set? */
            if (0U != p_sci_iic_info->cnt1st)
            {
                /* Transmits a 1st data. */
                sci_iic_set_sending_data(p_sci_iic_info, p_sci_iic_info->p_data1st);

                /* Decreases the 1st data counter. */
                p_sci_iic_info->cnt1st--;

                /* Increases the 1st data buffer pointer. */
                p_sci_iic_info->p_data1st++;

                return ret;
            }

            /* Sets the internal status. */
            sci_iic_set_internal_status(p_sci_iic_info, SCI_IIC_STS_ST_COND_WAIT);

            /* Restarts the condition generation */
            sci_iic_re_start_cond_generate(p_sci_iic_info);

        break;

        default :
            ret = SCI_IIC_ERR_OTHER;
        break;
    }

    return ret;
} /* End of function sci_iic_write_data_sending() */

/***********************************************************************************************************************
 * Function Name: sci_iic_read_data_receiving
 * Description  : After Receiving Data Processing (Func5).
 *                Performs one of the following processing  according to the state.
 *                Receives a data. Generates stop condition.
 * Arguments    : sci_iic_info_t * p_sci_iic_info    ; IIC Information
 * Return Value : SCI_IIC_SUCCESS                    ; Successful operation, communication state
 **********************************************************************************************************************/
static sci_iic_return_t sci_iic_read_data_receiving (sci_iic_info_t * p_sci_iic_info)
{
    sci_iic_return_t ret = SCI_IIC_SUCCESS;
    sci_regs_t pregs = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom->regs;

    if (1U >= p_sci_iic_info->cnt2nd)
    {
        /* Processing before receiving the "last byte - 1byte" in RX. */
        /* SIMR2 - I2C Mode Register 2
         b5     IICACKT - ACK Transmission Data - ACK transmission.*/
        pregs->SIMR2.BIT.IICACKT = SCI_IIC_NACK_TRANS;
    }

    if (0U >= p_sci_iic_info->cnt2nd)
    {
        /* Stores the received data. */
        (*p_sci_iic_info->p_data2nd) = sci_iic_get_receiving_data(p_sci_iic_info);

        /* Sets the internal status. */
        sci_iic_set_internal_status(p_sci_iic_info, SCI_IIC_STS_SP_COND_WAIT);

        /* Generates the stop condition. */
        sci_iic_stop_cond_generate(p_sci_iic_info);
    }
    else
    {
        /* Stores the received data. */
        (*p_sci_iic_info->p_data2nd) = sci_iic_get_receiving_data(p_sci_iic_info);
        p_sci_iic_info->cnt2nd--; /* Decreases the receiving data counter.  */
        p_sci_iic_info->p_data2nd++; /* Increases the receiving data buffer pointer. */

