renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_sci_iic_rx/src/r_sci_iic_rx.c
/***********************************************************************************************************************
 * Function Name: sci_iic_check_chstatus_advance
 * Description  : Check Channel Status Processing (at Advance Function).
 *                When calls the advance function, checks channel status.
 * Arguments    : sci_iic_info_t * p_sci_iic_info    ; IIC Information
 * Return Value : SCI_IIC_SUCCESS                    ; Successful operation
 *              : SCI_IIC_ERR_NO_INIT                ; Uninitialized state
 *              : SCI_IIC_ERR_BUS_BUSY               ; Bus busy
 *              ; SCI_IIC_ERR_OTHER                  ; Other error
 **********************************************************************************************************************/
static sci_iic_return_t sci_iic_check_chstatus_advance (sci_iic_info_t * p_sci_iic_info)
{
    sci_iic_return_t ret = SCI_IIC_ERR_OTHER;

    /* Checks the channel status. */
    switch (g_sci_iic_ChStatus[p_sci_iic_info->ch_no])
    {
        case SCI_IIC_NO_INIT :

            /* It is necessary to reinitialize. */
            /* Sets the return value to uninitialized state. */
            ret = SCI_IIC_ERR_NO_INIT;

        break;

        case SCI_IIC_IDLE :
        case SCI_IIC_FINISH :
        case SCI_IIC_NACK :

            /* Sets the return value to error state. */
            ret = SCI_IIC_ERR_OTHER;

        break;

        case SCI_IIC_COMMUNICATION :

            /* Checks the device status. */
            if ((((SCI_IIC_NO_INIT == p_sci_iic_info->dev_sts) || (SCI_IIC_IDLE == p_sci_iic_info->dev_sts))
                    || (SCI_IIC_FINISH == p_sci_iic_info->dev_sts)) || (SCI_IIC_NACK == p_sci_iic_info->dev_sts))
            {
                /* Sets the return value to idle state. */
                ret = SCI_IIC_ERR_OTHER;
            }
            else if (SCI_IIC_COMMUNICATION == p_sci_iic_info->dev_sts)
            {
                /* The device or another device is on communication. */
                /* Sets the return value to communication state. */
                ret = SCI_IIC_SUCCESS;
            }
            else
            {
                /* The device is in uninitialized state, communicating state or error state. */
                ret = SCI_IIC_ERR_OTHER;
            }

        break;

        default :

            ret = SCI_IIC_ERR_OTHER;

        break;
    }

    return ret;
} /* End of function sci_iic_check_chstatus_advance() */

/***********************************************************************************************************************
 * Function Name: sci_iic_disable
 * Description  : Disables IIC. Disables interrupt. Initializes IIC bus interrupt enable register.
 *              : Sets internal status.
 * Arguments    : sci_iic_info_t * p_sci_iic_info     ;   IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void sci_iic_disable (sci_iic_info_t * p_sci_iic_info)
{
    /* Initializes the IIC bus interrupt enable register. */
    sci_iic_int_icier_setting(p_sci_iic_info, SCI_IIC_SCR_INIT);

    /* Disables IIC. */
    sci_iic_iic_disable(p_sci_iic_info);

    /* Disables the interrupt. */
    r_sci_iic_int_disable(p_sci_iic_info);

    /* Sets the internal status. */
    sci_iic_set_internal_status(p_sci_iic_info, SCI_IIC_STS_IDLE);
} /* End of function sci_iic_disable() */

/***********************************************************************************************************************
 * Function Name: sci_iic_enable
 * Description  : Enables IIC bus interrupt enable register.
 *              : Enables interrupt. Enables IIC.
 * Arguments    : sci_iic_info_t * p_sci_iic_info     ;   IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void sci_iic_enable (sci_iic_info_t * p_sci_iic_info)
{
    /* Enables IIC.*/
    sci_iic_iic_enable(p_sci_iic_info);

    /* Enables IIC bus interrupt enable register. */
    sci_iic_int_icier_setting(p_sci_iic_info, SCI_IIC_SCR_ENABLE);

    /* Enables the interrupt. */
    r_sci_iic_int_enable(p_sci_iic_info);
} /* End of function sci_iic_enable() */

/***********************************************************************************************************************
 * Function Name: sci_iic_stop_cond_wait
 * Description  : Wait for Stop Condition Generation Processing.
 *                Checks the stop condition generation and checks form "bus busy" to "bus ready".
 * Arguments    : sci_iic_info_t * p_sci_iic_info     ;   IIC Information
 * Return Value : SCI_IIC_TRUE                        ;   Successful operation ,stop condition generation
 *              : SCI_IIC_FALSE                       ;   Failed operation ,stop condition generation
 **********************************************************************************************************************/
static bool sci_iic_stop_cond_wait (sci_iic_info_t * p_sci_iic_info)
{
    volatile uint16_t cnt;
    bool boolret = SCI_IIC_TRUE;

    cnt = SCI_IIC_STOP_COND_WAIT;
    do
    {
        /* Checks the stop condition generation. */
        if (SCI_IIC_TRUE == sci_iic_check_stop_event(p_sci_iic_info))
        {
            return boolret;
        }
        cnt--;
    } while (0U != cnt);/* WAIT_LOOP */

    /* Stop Condition generation error? */
    if (0U == cnt)
    {
        boolret = SCI_IIC_FALSE;
    }

    return boolret;
} /* End of function sci_iic_stop_cond_wait() */

/***********************************************************************************************************************
 * Function Name: sci_iic_check_stop_event
 * Description  : Check Event Flag Processing (at Stop Condition Generation).
 *                Checks the event flag.
 * Arguments    : sci_iic_info_t * p_sci_iic_info     ;   IIC Information
 * Return Value : SCI_IIC_TRUE                        ;   Sets the event flag to SCI_IIC_EV_INT_STOP.
 *              : SCI_IIC_FALSE                       ;   Does not set the event flag to SCI_IIC_EV_INT_STOP.
 **********************************************************************************************************************/
static bool sci_iic_check_stop_event (sci_iic_info_t * p_sci_iic_info)
{
    bool boolret = SCI_IIC_TRUE;
    sci_regs_t pregs = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom->regs;

