renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_sci_iic_rx/src/r_sci_iic_rx.c
/***********************************************************************************************************************
 * Function Name: sci_iic_reset_setting
 * Description  : SCI reset setting.
 * Arguments    : sci_iic_info_t * p_sci_iic_info     ;   IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void sci_iic_reset_setting (sci_iic_info_t * p_sci_iic_info)
{
    sci_regs_t pregs = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom->regs;
    volatile uint8_t dummy;

    /* Initializes the IIC bus interrupt enable register. */
    /* Serial Reception/Transmission is Disabled.*/
    pregs->SCR.BYTE = SCI_IIC_SCR_INIT;

    /* Dummy read RDR for clear SSR.RDRF */
    dummy = pregs->RDR;

 } /* End of function sci_iic_reset_setting() */

/***********************************************************************************************************************
 * Function Name: r_sci_iic_txi_isr_processing
 * Description  : TXI Processing.
 * Arguments    : uint8_t ch_no    ; number of channel
 * Return Value : None
 **********************************************************************************************************************/
void r_sci_iic_txi_isr_processing (uint8_t ch_no)
{
    sci_regs_t pregs = g_sci_iic_handles[ch_no]->prom->regs;

    /* ---- Checks NACK reception. ---- */
    if ((((SCI_IIC_MODE_SEND == g_sci_iic_handles[ch_no]->api_mode)
            || (SCI_IIC_STS_SEND_SLVADR_R_WAIT == g_sci_iic_handles[ch_no]->api_n_status))
            || ((SCI_IIC_MODE_SEND_RECEIVE == g_sci_iic_handles[ch_no]->api_mode)
                    && (SCI_IIC_STS_SEND_SLVADR_W_WAIT == g_sci_iic_handles[ch_no]->api_n_status)))
            || ((SCI_IIC_MODE_SEND_RECEIVE == g_sci_iic_handles[ch_no]->api_mode)
                    && (SCI_IIC_STS_SEND_DATA_WAIT == g_sci_iic_handles[ch_no]->api_n_status)))
    {
        /* ---- Receive NACK reception ---- */
        if (0U != pregs->SISR.BIT.IICACKR)
        {
            g_sci_iic_handles[ch_no]->api_event = SCI_IIC_EV_INT_NACK;
        }
        else
        {
            /* Sets event. */
            switch (g_sci_iic_handles[ch_no]->api_n_status)
            {
                case SCI_IIC_STS_SEND_SLVADR_W_WAIT :
                case SCI_IIC_STS_SEND_SLVADR_R_WAIT :
                case SCI_IIC_STS_RECEIVE_DATA_WAIT :

                    /* Sets interrupted address sending. */
                    g_sci_iic_handles[ch_no]->api_event = SCI_IIC_EV_INT_ADD;

                break;

                case SCI_IIC_STS_SEND_DATA_WAIT :

                    /* Sets interrupted data sending. */
                    g_sci_iic_handles[ch_no]->api_event = SCI_IIC_EV_INT_SEND;

                break;

                default :

                    /* Does nothing. */

                break;
            }

        }

    }
    else
    {
        /* ---- Receive ACK reception ---- */
        /* Sets event. */
        switch (g_sci_iic_handles[ch_no]->api_n_status)
        {
            case SCI_IIC_STS_SEND_SLVADR_W_WAIT :
            case SCI_IIC_STS_SEND_SLVADR_R_WAIT :
            case SCI_IIC_STS_RECEIVE_DATA_WAIT :

                /* Sets interrupted address sending. */
                g_sci_iic_handles[ch_no]->api_event = SCI_IIC_EV_INT_ADD;

            break;

            case SCI_IIC_STS_SEND_DATA_WAIT :

                /* Sets interrupted data sending. */
                g_sci_iic_handles[ch_no]->api_event = SCI_IIC_EV_INT_SEND;

            break;

            default :

                /* Does nothing. */

            break;
        }

    }

} /* End of function r_sci_iic_txi_isr_processing() */

/***********************************************************************************************************************
 * Function Name: r_sci_iic_tei_isr_processing
 * Description  : TEI Processing
 * Arguments    : uint8_t ch_no    ; number of channel
 * Return Value : None
 **********************************************************************************************************************/
void r_sci_iic_tei_isr_processing (uint8_t ch_no)
{
    sci_regs_t pregs = g_sci_iic_handles[ch_no]->prom->regs;

    /* Clear IR flag */
    pregs->SIMR3.BIT.IICSTIF = SCI_IIC_IICSTIF_CLEAR;

    /* WAIT_LOOP */
    while (SCI_IIC_IICSTIF_CLEAR != pregs->SIMR3.BIT.IICSTIF)
    {
        /* nothing to do */
    }

    /* WAIT_LOOP */
    while (0 != ((*g_sci_iic_handles[ch_no]->prom->pir_tei) & (g_sci_iic_handles[ch_no]->prom->tei_ir_mask)))
    {
        /* nothing to do */
    }

    /* ---- Checks NACK reception. ---- */
    if (0U != pregs->SISR.BIT.IICACKR)
    {
        g_sci_iic_handles[ch_no]->api_event = SCI_IIC_EV_INT_NACK;
    }

    /* ---- Checks start condition detection. ---- */
    if ((SCI_IIC_STAREQ == g_sci_iic_handles[ch_no]->mode) || (SCI_IIC_RSTAREQ == g_sci_iic_handles[ch_no]->mode))
    {
        g_sci_iic_handles[ch_no]->mode = 0;

        /* Sets event flag. */
        g_sci_iic_handles[ch_no]->api_event = SCI_IIC_EV_INT_START;
    }

    /* ---- Checks stop condition detection. ---- */
    if (SCI_IIC_STPREQ == g_sci_iic_handles[ch_no]->mode)
    {
        /* Sets event flag. */
        g_sci_iic_handles[ch_no]->api_event = SCI_IIC_EV_INT_STOP;
    }
} /* End of function r_sci_iic_tei_isr_processing() */

